W8D1/reddit/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "details", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Second Breakfast"], ["details", "Good food"], ["moderator_id", 34], ["created_at", "2020-06-29 21:18:04.320595"], ["updated_at", "2020-06-29 21:18:04.320595"]]
---
  def create
    @sub = Sub.new(sub_params)
    @sub.moderator_id = current_user.id
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "subs" SET "details" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["details", "This place sucks"], ["updated_at", "2020-06-29 21:30:11.476559"], ["id", 10]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.moderator_id == current_user.id
      if @sub.update(sub_params)