W6D3/routes_project/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        @artwork_shares = ArtworkShare.all