W6D3/routes_project/app/controllers/artworks_controller.rb

    def index

      if params.has_key?(:user_id)
        @artworks = Artwork.where(artist_id: params[:user_id])
        @artworks_shared = Artwork.joins(:shared_viewers).where(artwork_shares: {viewer_id: params[:user_id]})
      else
        @artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 22]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artwork_shares"."viewer_id" = $1  [["viewer_id", 21]]
SELECT "artworks".* FROM "artworks"

    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_id" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_id", 22], ["updated_at", "2020-06-18 13:38:42.718752"], ["id", 6]]

    def add_favorites
      @artwork = Artwork.find(params[:id])

      if @artwork.update(artist_favorite: true)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "artist_favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["artist_favorite", true], ["updated_at", "2020-06-18 19:25:45.386801"], ["id", 3]]