W6D3/routes_project/app/controllers/comments_controller.rb

    def index
      if params.has_key?(:user_id) #localhost:3000/users/22/comments
        @comments = Comment.where(user_id: params[:user_id])

      elsif params.has_key?(:artwork_id)    #localhost:3000/artworks/3/comments
        @comments = Comment.where(artwork_id: params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 22]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]

    def create
    comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 21], ["artwork_id", 4], ["body", "Nice Lion, it's a cool piece though"], ["created_at", "2020-06-18 15:48:55.143223"], ["updated_at", "2020-06-18 15:48:55.143223"]]