W6D3/routes_project/app/controllers/likes_controller.rb

    def index
        if params.has_key?("artwork_id")
           @likes = Like.where(likeable_id: params[:artwork_id]).where(likeable_type: "Artwork")
        elsif params.has_key?("comment_id")
            @likes = Like.where(likeable_id: params[:comment_id]).where(likeable_type: "Comment")
---
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" IS NULL AND "likes"."likeable_type" IS NULL
SELECT "likes".* FROM "likes" WHERE "likes"."likeable_id" = $1 AND "likes"."likeable_type" = $2  [["likeable_id", 3], ["likeable_type", "Artwork"]]

    def create
    likes = Like.new(like_params)
        if likes.save
---
INSERT INTO "likes" ("user_id", "likeable_id", "likeable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 21], ["likeable_id", 3], ["likeable_type", "Comment"], ["created_at", "2020-06-18 18:47:45.394727"], ["updated_at", "2020-06-18 18:47:45.394727"]]