W6D3/routes_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "jonathansu"]]
SELECT "users".* FROM "users" WHERE (username LIKE '%'jon'%')
---
    def index
    #   @users = User.all
    #   render json: @users
        query_string = params[:username]
        if params.keys.length > 2
            #@users = User.where("users.username LIKE '%#{query_string}%'")
            @users = User.where("users.username LIKE ?","%#{query_string}%")
        else
            @users = User.all

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "kafele kossaly"], ["email", "kafele@appacademy.io"]]
---
    def create
        user = User.new(params.require(:user).permit(:username))
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "rosemary gonzaga"], ["email", "rosemary@gmail.com"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])

        if @user.update(user_params)

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 AND "artworks"."artist_favorite" = $2  [["artist_id", 21], ["artist_favorite", true]]
---
    def favorites
      @favorites = Artwork.where(artist_id: params[:id]).where(artist_favorite: true)