W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
    def index
        @kitties = Cat.all

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        @kitty = Cat.find(params[:id])