W7D3/goal_app/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        user = User.new(user_params)

        if user.save